/*

LinkedList -> 하나의 저장될 데이터가 있을때 마다 데이터와 그 다음 연결될 데이터의 주소값을 가지는
			  두가지의 공간을 생성  :  [데이터][다음데이터주소] -> [데이터][다음데이터주소] -> ...
 

장점 
	1. 미리 데이터 공간을 할당하지 않아도 된다
		- 배열은 미리 데이터 공간을 할당
단점
	1. 연결을 위한 별도의 데이터 공간이 필요하므로, 저장곤간의 효율이 높지 않다.
	2. 연결 정보를 찾는 시간이 필요하므로 접근속도가 느리다
		ex) 0번째에서 3번째를 찾으려면  1, 2번째를 거쳐가야 한다.
	3. 중간 데이터 삭제시, 앞뒤 데이터의 연결을 재구성해야 하는 부가적인 작업 필요

용어
	노드 : 데이터 저장 단위 [데이터,다음주소데이터(포인터)] 로 구성
	포인터 : 각 노드 안에서, 다음이나 이전의 노드와의 연결 정보를 가지고 있는 공간
	

*/

/*

Doubly Linked List -> 이중 연결 리스트    x <- [주소,데이터,주소] -> <- [주소,데이터,주소] -> x



*/